; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	infrared1 - mode
	image2 - mode
	image0 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared1)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument7 image2)
	(supports instrument7 image0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon10)
	(pointing satellite3 Star7)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 image0)
	(have_image Star7 image0)
	(have_image Planet8 infrared1)
	(have_image Planet9 image0)
	(have_image Phenomenon10 image2)
))

)

; plan
1. (turn_to satellite3 star7 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star7)
   goals met: 1 of 9
2. (turn_to satellite1 star0 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star0)
   goals met: 1 of 9
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
4. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 9
5. (turn_to satellite1 planet6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet6)
   goals met: 1 of 9
6. (take_image satellite1 planet6 instrument3 image0)
   added: (have_image planet6 image0)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 9
8. (turn_to satellite0 star2 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star2)
   goals met: 3 of 9
9. (take_image satellite1 phenomenon5 instrument3 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 4 of 9
10. (turn_to satellite1 planet8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet8)
   goals met: 4 of 9
11. (take_image satellite1 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 5 of 9
12. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 5 of 9
13. (take_image satellite1 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 6 of 9
14. (turn_to satellite1 star7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star7)
   goals met: 6 of 9
15. (take_image satellite1 star7 instrument3 image0)
   added: (have_image star7 image0)
   goals met: 7 of 9
16. (turn_to satellite1 phenomenon10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon10)
   goals met: 8 of 9
17. (take_image satellite1 phenomenon10 instrument3 image2)
   added: (have_image phenomenon10 image2)
   goals met: 9 of 9
